# # Написать функцию которая генерирует словарь, где ключ это буква строки, а значение это число, сколько раз повторяется
# # данная буква в этой строке
# # строку вводит пользователь
#
# str=input('asd')
# print(str)
# def gen_dict():
#     dict1={}
#     for i in str:
#         dict1[i]=str.count(i)
#     return dict1
# print(gen_dict())
# 2. реализовать калькулятор где операции это функуии

chislo1=int(input('введите первое число'))
operator=input('введите оператор')
chislo2=int(input('введите второе число'))
